create_clock -name clk -period 20 [get_ports clk]
set_clock_uncertainty 0.1 [get_clocks clk]
set_input_delay 0.5 -clock clk [get_ports ui_in]
set_output_delay 0.5 -clock clk [get_ports uo_out]
set_dont_touch [get_cells -hier *gen_osc*]